
namespace Common.Formatting.Tables.Customizable {

    /// <summary>
    /// Набір символів для формування горизонтальної лінії або рядка таблиці
    /// </summary>
    public class LineCharSet {

        /// <summary>
        /// Символ перетину лінії з лівою вертикальною межею
        /// </summary>
        public char L = ' ';

        /// <summary>
        /// Символ перетину лінії з внутрішньою вертикальною лінією
        /// </summary>
        public char I = ' ';

        /// <summary>
        /// Символ перетину лінії з правою вертикальною межею
        /// </summary>
        public char R = ' ';

        /// <summary>
        /// Символ заповнення інтервалу між вертикальними лініями
        /// </summary>
        public char H = ' ';

        /// <summary>
        /// Ініціалізує новий набір символів для формування 
        /// горизонтальної лінії або рядка таблиці
        /// </summary>
        /// <param name="l">символ перетину лінії з лівою вертикальною межею</param>
        /// <param name="i">символ перетину лінії з внутрішньою вертикальною лінією</param>
        /// <param name="r">символ перетину лінії з правою вертикальною межею</param>
        /// <param name="h">символ заповнення інтервалу між вертикальними лініями</param>
        public LineCharSet(char l, char i, char r, char h) {
            L = l; I = i; R = r; H = h;
        }

        /// <summary>
        /// Ініціалізує новий набір символів для формування
        /// горизонтальної лінії або рядка таблиці
        /// у відповідності з ініціалізаторами 
        /// </summary>
        public LineCharSet() { }
    }

}
